hpc-batch-ctk/user_examples/airfoil_optimization/third_party/openfoam_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
  =========                 | 
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox 
   \    /   O peration     | Website:  https://openfoam.org 
    \  /    A nd           | Version:  6 
     \/     M anipulation  | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1; 

vertices
(
    (0.0 0.0 0)
    (21.0 -10.0 0)
    (1.874885892508946 -10.0 0)
    (0.0 -10.0 0)
    (-10.0 0.0 0)
    (0.0 10.0 0)
    (1.874885892508946 10.0 0)
    (21.0 10.0 0)
    (21.0 0.11191546081530027 0)
    (21.0 0.011915460815300255 0)
    (21.0 -0.08808453918469974 0)
    (1.012375985110472 0.0992312198481172 0)
    (1.0 0.0 0)
    (1.0118351394537137 -0.0992971775737415 0)
    (0.24937594923916034 0.16137495780955158 0)
    (0.25 0.06137690502527033 0)
    (0.25 -0.05300899273354147 0)
    (0.25062405076083966 -0.15300704551782274 0)
    (-0.1 0.0 0)
    (0.0 0.0 1)
    (21.0 -10.0 1)
    (1.874885892508946 -10.0 1)
    (0.0 -10.0 1)
    (-10.0 0.0 1)
    (0.0 10.0 1)
    (1.874885892508946 10.0 1)
    (21.0 10.0 1)
    (21.0 0.11191546081530027 1)
    (21.0 0.011915460815300255 1)
    (21.0 -0.08808453918469974 1)
    (1.012375985110472 0.0992312198481172 1)
    (1.0 0.0 1)
    (1.0118351394537137 -0.0992971775737415 1)
    (0.24937594923916034 0.16137495780955158 1)
    (0.25 0.06137690502527033 1)
    (0.25 -0.05300899273354147 1)
    (0.25062405076083966 -0.15300704551782274 1)
    (-0.1 0.0 1)
);

blocks
(
    hex (2 1 10 13 21 20 29 32) (188 91 1) simpleGrading (11.939222600280344 99.2010894518313 99.2010894518313 11.939222600280344 0.012162813885540929 0.012162813885540929 0.012162813885540929 0.012162813885540929 1 1 1 1) 
    hex (3 2 13 17 22 21 32 36) (100 91 1) simpleGrading (0.8043442555552571 2.7802680806813016 2.7802680806813016 0.8043442555552571 0.012318660869755438 0.012162813885540929 0.012162813885540929 0.012318660869755438 1 1 1 1) 
    hex (4 3 17 18 23 22 36 37) (31 91 1) edgeGrading (0.0125 0.5 0.5 0.0125 0.012162813885540929 0.012318660869755438 0.012318660869755438 0.012162813885540929 1 1 1 1) 
    hex (4 18 14 5 23 37 33 24) (91 31 1) edgeGrading (0.012162813885540929 0.012332146282250104 0.012332146282250104 0.012162813885540929 0.0125 0.5 0.5 0.0125 1 1 1 1) 
    hex (14 11 6 5 33 30 25 24) (69 91 1) edgeGrading (1.940521466601332 0.8043442555552571 0.8043442555552571 1.940521466601332 81.08888567429007 82.21781648642946 82.21781648642946 81.08888567429007 1 1 1 1) 
    hex (11 8 7 6 30 27 26 25) (188 91 1) simpleGrading (99.2010894518313 11.939222600280344 11.939222600280344 99.2010894518313 82.21781648642946 82.21781648642946 82.21781648642946 82.21781648642946 1 1 1 1) 
    hex (12 9 8 11 31 28 27 30) (188 37 1) simpleGrading (99.2010894518313 6.081406942770463 1) 
    hex (15 12 11 14 34 31 30 33) (69 37 1) egeeGrading (0.8 1.940521466601332 1.940521466601332 0.8 6.081406942770463 6.081406942770463 6.081406942770463 6.081406942770463 1 1 1 1) 
    hex (0 15 14 18 19 34 33 37) (31 37 1) edgeGrading (2 0.5 0.5 2 6.081406942770463 6.081406942770463 6.081406942770463 6.081406942770463 1 1 1 1) 
    hex (18 17 16 0 37 36 35 19) (31 37 1) edgeGrading (0.5 2 2 0.5 0.16443563297285893 0.16443563297285893 0.16443563297285893 0.16443563297285893 1 1 1 1) 
    hex (17 13 12 16 36 32 31 35) (100 37 1) edgeGrading (2.7802680806813016 0.8 0.8 2.7802680806813016 0.16443563297285893 0.16443563297285893 0.16443563297285893 0.16443563297285893 1 1 1 1) 
    hex (13 10 9 12 32 29 28 31) (188 37 1) simpleGrading (99.2010894518313 0.16443563297285893 1) 
);

edges
(
    polyLine 11 14
    (
        (0.9628629851104722 0.1072032198481172 0)
        (0.8231402041212244 0.12462308868179173 0)
        (0.620365470037334 0.14604821642036797 0)
        (0.39269751660566393 0.1621870374356732 0)
    )
    polyLine 30 33
    (
        (0.9628629851104722 0.1072032198481172 1)
        (0.8231402041212244 0.12462308868179173 1)
        (0.620365470037334 0.14604821642036797 1)
        (0.39269751660566393 0.1621870374356732 1)
    )
    polyLine 14 18
    (
        (0.18050951905909302 0.16071981130348456 0)
        (0.01753571188987543 0.13229828125042253 0)
        (-0.060911529838909566 0.07930816813345036 0)
    )
    polyLine 33 37
    (
        (0.18050951905909302 0.16071981130348456 1)
        (0.01753571188987543 0.13229828125042253 1)
        (-0.060911529838909566 0.07930816813345036 1)
    )
    polyLine 18 17
    (
        (0.03717705928454433 -0.13267213106471776 0)
        (0.18245080382378054 -0.15210554523480113 0)
    )
    polyLine 37 36
    (
        (0.03717705928454433 -0.13267213106471776 1)
        (0.18245080382378054 -0.15210554523480113 1)
    )
    polyLine 17 13
    (
        (0.39042546576947523 -0.15458456622036196 0)
        (0.6179481430221775 -0.14271346867277931 0)
        (0.8218592811276131 -0.12405612464393043 0)
        (0.9623171394537138 -0.1073281775737415 0)
    )
    polyLine 36 32
    (
        (0.39042546576947523 -0.15458456622036196 1)
        (0.6179481430221775 -0.14271346867277931 1)
        (0.8218592811276131 -0.12405612464393043 1)
        (0.9623171394537138 -0.1073281775737415 1)
    )
    spline 12 15
    (
        (0.950487 0.007972 0)
        (0.811863 0.025261 0)
        (0.611647 0.046429 0)
        (0.389264 0.062246 0)
    )
    spline 31 34
    (
        (0.950487 0.007972 1)
        (0.811863 0.025261 1)
        (0.611647 0.046429 1)
        (0.389264 0.062246 1)
    )
    arc 4 5 (-7.071072502792263 7.071063120935576 0)
    arc 3 4 (-7.071072502792263 -7.071063120935576 0)
    arc 23 24 (-7.071072502792263 7.071063120935576 1)
    arc 22 23 (-7.071072502792263 -7.071063120935576 1)
    spline 15 0
    (
        (0.187842 0.060989 0)
        (0.048417 0.037186 0)
        (0.0 0.0 0)
    )
    spline 34 19
    (
        (0.187842 0.060989 1)
        (0.048417 0.037186 1)
        (0.0 0.0 1)
    )
    spline 0 16
    (
        (0.050614 -0.033579 0)
        (0.188668 -0.052299 0)
    )
    spline 19 35
    (
        (0.050614 -0.033579 1)
        (0.188668 -0.052299 1)
    )
    spline 16 12
    (
        (0.388215 -0.054609 0)
        (0.610874 -0.042964 0)
        (0.811627 -0.024581 0)
        (0.950482 -0.008031 0)
    )
    spline 35 31
    (
        (0.388215 -0.054609 1)
        (0.610874 -0.042964 1)
        (0.811627 -0.024581 1)
        (0.950482 -0.008031 1)
    )
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
          (1 2 13 10)
          (2 3 17 13)
          (3 4 18 17)
          (18 4 5 14)
          (11 14 5 6)
          (8 11 6 7)
          (9 12 11 8)
          (12 15 14 11)
          (0 18 14 15)
          (17 18 0 16)
          (13 17 16 12)
          (10 13 12 9)
          (21 20 29 32)
          (22 21 32 36)
          (23 22 36 37)
          (23 37 33 24)
          (33 30 25 24)
          (30 27 26 25)
          (31 28 27 30)
          (34 31 30 33)
          (37 19 34 33)
          (37 36 35 19)
          (36 32 31 35)
          (32 29 28 31)
         );
     }
    farfield
    {
        type patch;
        faces
        (
          (4 23 24 5)
          (5 24 25 6)
          (6 25 26 7)
          (27 8 7 26)
          (28 9 8 27)
          (29 10 9 28)
          (20 1 10 29)
          (21 2 1 20)
          (22 3 2 21)
          (23 4 3 22)
         );
     }
    airfoil
    {
        type wall;
        faces
        (
          (34 15 12 31)
          (19 0 15 34)
          (0 19 35 16)
          (16 35 31 12)
         );
     }
);
